{"pageProps":{"postContent":[{"type":"heading","children":[{"type":"plain","text":"Gameplay"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"Perhaps my all-time favorite open-world game."}]},{"type":"paragraph","children":[{"type":"plain","text":"I was never a discover-every-question-mark type of guy, but Ghost of Tsushima inspired me to do so. It’s probably for the graphics and the combat. Interacting with the world is enjoyable and fulfilling."}]},{"type":"paragraph","children":[{"type":"plain","text":"The combat system was simple and fun. Counter-attacking and slashing people was satisfying. I set the game’s difficulty to hard so that I can enjoy the combat more, which is something I’ve never done in any other game."}]},{"type":"paragraph","children":[{"type":"plain","text":"The developer of this game, Sucker Punch Studio, intended to maximize the immersion of Tsushima. The idea that current games provide too much hands-on support and instruction, treating players like toddlers, has nearly become a cliche. You get a quest list, as well as a target distance and direction indicator, and the character will remind you with lines every thirty seconds."}]},{"type":"image","url":"ghost-of-tsushima_1.png","caption":"Not the image I was looking for, but you get the idea.","alt":null},{"type":"paragraph","children":[{"type":"plain","text":"There are three primary target indicators in Tsushima: the wind, the golden bird, and the foxes. All of them are dietetic, so the players don’t have to extract themselves from the immersion every time they want to check their current goals. These tools make roam play without accessing the map possible and enjoyable. An excellent direction for an open-world game."}]},{"type":"paragraph","children":[{"type":"plain","text":"Additionally, Sucker Punch made an “expert” mode which minimizes the HUD. Most of the time, there isn’t anything meta on the screen. It does make discovering objects a little more difficult, but the trade-off for immersion is, in my opinion, well worth it. I believe it’s how Ghost of Tsushima intended to be played."}]},{"type":"heading","children":[{"type":"plain","text":"Narrative"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"Ghost of Tsushima is one of the best samurai simulator games. Despite being a United States-based Studio with a majority of staff born and raised in the West, Sucker Punch Studio brilliantly captured the authenticity of the Kamakura-era Japan."}]},{"type":"paragraph","children":[{"type":"plain","text":"However, all of the dialogues and the motion capture were done in English. Although the Japanese localization was well done, the Japanese dialogue, which had to match the flow of the English-based conversation, feels a little off. Not to mention that, even with updates, the animation lip-syncs for Japanese are practically non-existent."}]},{"type":"paragraph","children":[{"type":"plain","text":"It became a dilemma whether to play in English for more fluency or to play in Japanese for more authenticity. Both were not perfect."}]},{"type":"thematicBreak"},{"type":"paragraph","children":[{"type":"plain","text":"Overall, a great game. Looking forward to 100% completion."}]}],"postMetadata":{"id":"ghost-of-tsushima","title":"Ghost of Tsushima","description":"","category":"Gaming","tags":["Review"],"publishDate":"2022-01-07","pathname":"ghost-of-tsushima"},"last5posts":[{"id":"site-patch-notes-2024-redesign","title":"Site Patch Notes: 2024 Redesign","description":"The 2024 redesign is finally here! I went on a journey of learning editorial design, and did an overhaul to this site's design, both functionality-wise and visual-wise.","category":"Meta","tags":[],"publishDate":"2024-08-18","pathname":"site-patch-notes-2024-redesign"},{"id":"a-peek-of-the-world","title":"A Peek of the World","description":"I went to Copenhagen and London for my honeymoon, the first trip to Europe in my life. Some memories keep staying on my mind and I have many thoughts about them.","category":"Life","tags":[],"publishDate":"2024-06-16","pathname":"a-peek-of-the-world"},{"id":"godot-essentials","title":"Godot Essentials","description":"The biggest lessons I learned in my first Godot project.","category":"Game Development","tags":[],"publishDate":"2024-04-21","pathname":"godot-essentials"},{"id":"4-years-reflection","title":"4 Years Reflection","description":"Another two years of life as a full-time developer has passed. Many things changed and many lessons learned. It's a perfect timing to look back and reflect.","category":"Life","tags":[],"publishDate":"2024-04-08","pathname":"4-years-reflection"},{"id":"improving-greatness","title":"Improving Greatness","description":"Breath of the Wild is one of the most impactful game in last decade. Yet for its successor, Nintendo built an even more polished version on an already magnificent fundamental.","category":"Gaming","tags":[],"publishDate":"2024-03-17","pathname":"improving-greatness"}],"categoryPosts":[{"id":"improving-greatness","title":"Improving Greatness","description":"Breath of the Wild is one of the most impactful game in last decade. Yet for its successor, Nintendo built an even more polished version on an already magnificent fundamental.","category":"Gaming","tags":[],"publishDate":"2024-03-17","pathname":"improving-greatness"},{"id":"god-of-war-ragnarok","title":"God of War Ragnarök","description":"As a successor of a game with solid gameplay and extraordinary narrative, God of War Ragnarök made attempts to be something better on many aspects. Some of them were great, some others were not.","category":"Gaming","tags":[],"publishDate":"2022-11-19","pathname":"god-of-war-ragnarok"},{"id":"dark-souls","title":"Dark Souls","description":"Though once a cult classic, the soul-like has become a mainstream genre. I beat its early entry to see its secrets and the reputation of unmerciful difficulty.","category":"Gaming","tags":[],"publishDate":"2022-07-19","pathname":"dark-souls"}],"categories":[{"name":"Meta","count":5},{"name":"Life","count":6},{"name":"Game Development","count":5},{"name":"Gaming","count":12},{"name":"League of Legends","count":8},{"name":"Web Development","count":4},{"name":"HKT48","count":4},{"name":"Programming","count":3},{"name":"Movie","count":2}]},"__N_SSG":true}