{"pageProps":{"postContent":[{"type":"paragraph","children":[{"type":"plain","text":"The last time I wrote a recap for my League of Legends season was 3 years ago. The reason is simple: I haven't been playing much."}]},{"type":"paragraph","children":[{"type":"plain","text":"Playing League solo takes a toll on your mental, and it became unbearable in recent years. The saddest part to me is that gameplay-wise I still love this game so much, but the player interaction part makes playing it painful."}]},{"type":"heading","children":[{"type":"plain","text":"League still has great gameplay"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"I played some Heroes of the Storm with my buddies last year."}]},{"type":"paragraph","children":[{"type":"plain","text":"All of us agreed that Heroes was not fun."}]},{"type":"paragraph","children":[{"type":"plain","text":"Based on the design and the idea, it should be fun, but it really isn't. Every move or attack feels bland in Heroes, and those are the most basic and important things in a MOBA. They stack up, and the game lacks satisfying feedback thus feels boring."}]},{"type":"paragraph","children":[{"type":"plain","text":"League, on the other hand, feels great to play. When the player does something right, be it last-hitting, kill, or smite win, the game makes sure to make the player know it by providing awesome feedback."}]},{"type":"paragraph","children":[{"type":"plain","text":"After playing it for more than a decade, it is easy to focus on the part that stands out when talking about League contents, like the collective 200 years of design experience. But I felt it is necessary and important to appreciate the parts Leagues are doing great and not take it for granted. It is the most popular game in the world for a reason."}]},{"type":"heading","children":[{"type":"plain","text":"Taiwan Server"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"Taiwan server left Garena and becomes almost directly managed by Riot this year. This is the second biggest event in the history of Taiwan server. The biggest one was the start of the old server ten years ago."}]},{"type":"paragraph","children":[{"type":"plain","text":"Me and my buddies who played ranked 5v5 in season 2 all were excited, and we assembled again after eleven years. A bunch of adults in their 30s gather at night or weekend to practice and talk about a game seriously, and we had a blast."}]},{"type":"paragraph","children":[{"type":"plain","text":"People are still dumb and toxic, but at least it is easier to cope with each other. League really is meant to be played with friends."}]},{"type":"heading","children":[{"type":"plain","text":"Switching to mid lane"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"Lately I started playing mid lane again. It started with Akali."}]},{"type":"paragraph","children":[{"type":"plain","text":"I fell in love with Akali, not lore wise, but gameplay wise. It is a mechanic-demanding champion, but when played right she is the most bad ass champion in the game."}]},{"type":"paragraph","children":[{"type":"plain","text":"Being in my 30s with a full time job, I didn't expect myself to make Bjerg level play with her, but after some games I did have some plays I'm pretty happy with."}]},{"type":"paragraph","children":[{"type":"plain","text":"Is playing Akali the most optimal way to win for me? Definitely not."}]},{"type":"paragraph","children":[{"type":"plain","text":"But is it fun? Oh boy did I have fun when I chase and kill those helpless AD carries in one rotation."}]},{"type":"paragraph","children":[{"type":"plain","text":"And during these Akali games I realized how much bigger the agency a mid laner has than a bot laner. As a mid laner you are able to impact the game so much so early, which is a feeling I haven't had for more than ten years."}]},{"type":"paragraph","children":[{"type":"plain","text":"When the disadvantages grow and situation becomes dire, what can you do as an AD carry? If my ID was Ruler maybe I can assassinate their carry and get away with it, but unfortunately it wasn't. I was merely an egg in a ramen. If the ramen is already rotten before 15 minutes, an egg is not going to make it edible. Let alone I'm not even a particularly good egg."}]},{"type":"paragraph","children":[{"type":"plain","text":"As a mid laner I have more tools to make play that may impact the game. One time I found their jungler and invaded him when he was still level 2. He was tilted and the game was over at that point. Another time when the enemy team was sieging after a successful team fight, I TP flanked and killed their Caitlyn. Such thing would not happen if I was an AD carry."}]},{"type":"paragraph","children":[{"type":"plain","text":"I don't usually win lane and snowball to win, but with my buddies I can play a more pivotal and supportive role with champions like Galio, trying to win games with not brawn but brain."}]},{"type":"paragraph","children":[{"type":"plain","text":"Then after we got our first win of the day I can int with Akali."}]},{"type":"heading","children":[{"type":"plain","text":"Esports"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"After the announcement of TSM selling their LCS spot, I stopped caring about LCS. To be honest I haven't for a while, I was just waiting for the last straw."}]},{"type":"paragraph","children":[{"type":"plain","text":"Instead I was rooting for Dplus KIA, or more precisely, ShowMaker. I love someone with a personality. DK official YouTube channel contents being hilarious also helped. I recognised the jewel of the famous K'Sante monologue before it was viral."}]},{"type":"paragraph","children":[{"type":"plain","text":"Unfortunately DK wasn’t playing good. They were in worlds nonetheless, but anyone wouldn't have any expectation after seen their play."}]},{"type":"paragraph","children":[{"type":"plain","text":"Last worlds had good narrative though, with the T1 storyline. Though I have great respect to Faker, I was never particularly a T1 fan. But after witnessing their championship, I was really happy and the emotion lingered for days."}]},{"type":"paragraph","children":[{"type":"plain","text":"Faker is unarguably the GOAT of League, but he hasn't won a championship for six years. It's about time."}]},{"type":"paragraph","children":[{"type":"plain","text":"And for those young prodigies, it would be such a tragedy if they fall short again, and such a catastrophe waste for such talents to be labeled chokers. I loved the redemption story, for all of them."}]}],"postMetadata":{"id":"s13-recap","title":"S13 Recap","description":"After a three years gap, I'm back to league.","category":"League of Legends","tags":[],"publishDate":"2024-01-23","pathname":"s13-recap"},"last5posts":[{"id":"site-patch-notes-2024-redesign","title":"Site Patch Notes: 2024 Redesign","description":"The 2024 redesign is finally here! I went on a journey of learning editorial design, and did an overhaul to this site's design, both functionality-wise and visual-wise.","category":"Meta","tags":[],"publishDate":"2024-08-18","pathname":"site-patch-notes-2024-redesign"},{"id":"a-peek-of-the-world","title":"A Peek of the World","description":"I went to Copenhagen and London for my honeymoon, the first trip to Europe in my life. Some memories keep staying on my mind and I have many thoughts about them.","category":"Life","tags":[],"publishDate":"2024-06-16","pathname":"a-peek-of-the-world"},{"id":"godot-essentials","title":"Godot Essentials","description":"The biggest lessons I learned in my first Godot project.","category":"Game Development","tags":[],"publishDate":"2024-04-21","pathname":"godot-essentials"},{"id":"4-years-reflection","title":"4 Years Reflection","description":"Another two years of life as a full-time developer has passed. Many things changed and many lessons learned. It's a perfect timing to look back and reflect.","category":"Life","tags":[],"publishDate":"2024-04-08","pathname":"4-years-reflection"},{"id":"improving-greatness","title":"Improving Greatness","description":"Breath of the Wild is one of the most impactful game in last decade. Yet for its successor, Nintendo built an even more polished version on an already magnificent fundamental.","category":"Gaming","tags":[],"publishDate":"2024-03-17","pathname":"improving-greatness"}],"categoryPosts":[],"categories":[{"name":"Meta","count":5},{"name":"Life","count":6},{"name":"Game Development","count":5},{"name":"Gaming","count":12},{"name":"League of Legends","count":8},{"name":"Web Development","count":4},{"name":"HKT48","count":4},{"name":"Programming","count":3},{"name":"Movie","count":2}]},"__N_SSG":true}