{"pageProps":{"postContent":[{"type":"paragraph","children":[{"type":"plain","text":"It has been two years since I became a full-time front-end developer."}]},{"type":"paragraph","children":[{"type":"plain","text":"TLDR, I’m still having a great time with it. Not considering changing jobs at the moment."}]},{"type":"heading","children":[{"type":"plain","text":"The job"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"I’m happy about my company for now. The environment, particularly the people, is way better than the previous one. The last few years killed almost all of my willingness to build bonds with the organization, but fortunately, my team has been chill and respectful."}]},{"type":"paragraph","children":[{"type":"plain","text":"The pay (and the raises) aren’t bad at all, but there is still a noticeable difference between it with my ideal number. I expect that changing employment will be the faster way to reach that goal, but choosing employers is like buying a lottery, and this place is such a comfort zone it feels like winning a prize."}]},{"type":"heading","children":[{"type":"plain","text":"The work"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"I was lucky enough to be assigned to build a brand new service. I learned more in the first two months than I had in the previous two years of self-study."}]},{"type":"paragraph","children":[{"type":"plain","text":"I found myself reading the source code more often when cooperating with the server team or using a new library. I don’t pretend I know anything besides front-end development, but sometimes I get to find the potentially issue-resolving part, even solutions that are not on the documents."}]},{"type":"paragraph","children":[{"type":"plain","text":"I also feel the way I develop is more organized. Setting up environments and tools, naming, file structure, everything. The biggest change is definitely scoping git commits and pull requests. In other words, I learned how to work with a team, and as part of a team. I appreciate the two patient mentors gratefully."}]},{"type":"paragraph","children":[{"type":"plain","text":"In fact, “developing as a team” is the absolute prime factor regarding how a developer should work in my opinion, after two years of professional software development experience. I’ve met people who (occasionally) write beautiful code, but I really hate to work with. I’ve also met people who write every pull request like ELI5. I remind myself to do my job like the latter every day."}]},{"type":"heading","children":[{"type":"plain","text":"The code"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"One of my favorite moments when writing code is when I solved a problem that has been bothering me for a while. I feel extremely lucky that it still goes this way for me to this day."}]},{"type":"paragraph","children":[{"type":"plain","text":"https://twitter.com/AsukaCHikaru/status/1504403347465715715"}]},{"type":"paragraph","children":[{"type":"plain","text":"Some people say don’t have your hobby as your job; some other people say you can’t write code forever (or even for over 20 years). I don’t know if that day will ever come, but I’m loving it so far."}]}],"postMetadata":{"id":"2-years-reflection","title":"2 Years Reflection","description":"Two years has passed since I started working as a front-end developer, the profession I dreamed and chased for.","category":"Life","tags":[],"publishDate":"2022-04-07","pathname":"2-years-reflection"},"last5posts":[{"id":"a-redemption-three-years-later","title":"A Redemption Three Years Later","description":"CD PROJECT RED made a promise about Night City, which they broke. Three years later they had another attempt, and to me, it was their redemption.","category":"Gaming","tags":[],"publishDate":"2025-01-13","pathname":"a-redemption-three-years-later"},{"id":"s14-recap","title":"S14 Recap","description":"I did not play a lot of league during 2024, but I had a few unforgettable moments nonetheless.","category":"League of Legends","tags":[],"publishDate":"2025-01-07","pathname":"s14-recap"},{"id":"thoughts-on-building-a-game-with-xstate","title":"Thoughts on Building a Game with XState","description":"After hearing about XState's good reputation for years, I used it to build the prototype for my game. These are my thoughts.","category":"Game Development","tags":[],"publishDate":"2025-01-04","pathname":"thoughts-on-building-a-game-with-xstate"},{"id":"under-the-hood-diablo-ii-item-generation","title":"Under the Hood: Diablo II Item Generation","description":"A system design research turned into a reconciliation with a game I didn't know I was so in love with, so I wrote a research note to express my appreciation.","category":"Game Development","tags":[],"publishDate":"2024-11-08","pathname":"under-the-hood-diablo-ii-item-generation"},{"id":"site-patch-notes-2024-redesign","title":"Site Patch Notes: 2024 Redesign","description":"The 2024 redesign is finally here! I went on a journey of learning editorial design, and did an overhaul to this site's design, both functionality-wise and visual-wise.","category":"Meta","tags":[],"publishDate":"2024-08-18","pathname":"site-patch-notes-2024-redesign"}],"categoryPosts":[{"id":"a-peek-of-the-world","title":"A Peek of the World","description":"I went to Copenhagen and London for my honeymoon, the first trip to Europe in my life. Some memories keep staying on my mind and I have many thoughts about them.","category":"Life","tags":[],"publishDate":"2024-06-16","pathname":"a-peek-of-the-world"},{"id":"4-years-reflection","title":"4 Years Reflection","description":"Another two years of life as a full-time developer has passed. Many things changed and many lessons learned. It's a perfect timing to look back and reflect.","category":"Life","tags":[],"publishDate":"2024-04-08","pathname":"4-years-reflection"},{"id":"city-of-stars","title":"City of Stars","description":"去了一趟夢想之都，不為了追夢，但仍然得到許多反思。","category":"Life","tags":[],"publishDate":"2019-09-12","pathname":"city-of-stars"},{"id":"so-fedc","title":"所以，FEDC","description":"我逼著自己參加了遠超我當時程度的前端技術研討會，結果得到了遠超講題內容的收穫。","category":"Life","tags":[],"publishDate":"2018-07-17","pathname":"so-fedc"},{"id":"sotsugyo","title":"卒業","description":"人生中充滿悲歡離合，而我不禁讚嘆日文如何描述離別，以及其中的美麗。","category":"Life","tags":[],"publishDate":"2017-01-17","pathname":"sotsugyo"}],"categories":[{"name":"Gaming","count":13},{"name":"League of Legends","count":9},{"name":"Game Development","count":7},{"name":"Meta","count":5},{"name":"Life","count":6},{"name":"Web Development","count":4},{"name":"HKT48","count":4},{"name":"Programming","count":3},{"name":"Movie","count":2}]},"__N_SSG":true}