{"pageProps":{"postContent":[{"type":"paragraph","children":[{"type":"plain","text":"There were a few unforgettable moments in the last league season. Most of them were not about my play."}]},{"type":"heading","children":[{"type":"plain","text":"Esports"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"This year's anthem was "},{"type":"italic","text":"Heavy Is the Crown"},{"type":"plain","text":" performed by the legendary band "},{"type":"italic","text":"Linkin Park"},{"type":"plain","text":". Because of the narrative around T1 and their championship run against the LPL teams at last worlds, I had high expectation for the music video, but it was disappointing to say at least."}]},{"type":"paragraph","children":[{"type":"plain","text":"The song grew on me, however. Despite the negative first impression, by the time the finals began, I was quite fond of the song, so I enjoyed the opening ceremony and the players introductions a lot. The sequence of the trophy ascending while Emily Armstrong screaming \""},{"type":"italic","text":"This is what you ask for"},{"type":"plain","text":"\", Mike Shinoda introducing the finalists, both teams entering the arena with Linkin Park playing in the background, then the audience cheering when Faker walked out, was legendary. In my opinion, this was the best opening ceremony performance in the history of league esports."}]},{"type":"paragraph","children":[{"type":"plain","text":"But the finals was even more amazing. Last year Faker did an incredible game-deciding play with Azir on Ruler; when the game is on the line and the margin for mistake is slim, only the best player can face the pressure and turn the tide, and the "},{"type":"italic","text":"Shurima Shuffle"},{"type":"plain","text":" was exactly such a play. This year the stakes were higher, the situation was more dire; when all hope seemed lost, Faker made tremendous play again—twice, which were the championship-deciding play, and the play before that. It was a true privilege to witness Faker do that on live, to watch him ascend once again."}]},{"type":"quote","children":[{"type":"plain","text":"Once again, when you need someone, when you need "},{"type":"italic","text":"anyone"},{"type":"plain","text":" to stand up, and to show just what this game is all about, it's Faker!"}]},{"type":"paragraph","children":[{"type":"plain","text":"It was also unbelievable to witness the narrative unfold. When the "},{"type":"italic","text":"Shurima Shuffle"},{"type":"plain","text":" happened last year, people tried to find any narrative they could to give the play more weight; this year we had the number one and two play of the year, which happened to be the last two plays of the year. Riot could not pray for a better storyline."}]},{"type":"heading","children":[{"type":"plain","text":"Arcane"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"After a long wait, Arcane season two was finally here. I binge-watched season one again before season two was released, and I was as impressed as the first time. The storytelling and character building were truly brilliant, it's difficult to find anything comparable to season one—even its own season two."}]},{"type":"paragraph","children":[{"type":"plain","text":"Overall I still enjoyed season two, but any shortcomings stand easy to notice after the all-time great season one. I wish they had a little more runtime, as the black rose plot line was more of a liability more than an asset in my opinion."}]},{"type":"paragraph","children":[{"type":"plain","text":"Season two, however, had my absolutely favorite moment in the series, which was of course episode seven, the "},{"type":"italic","text":"Ma Meilleure Ennemie"},{"type":"plain","text":" scene. Because we saw what it was not, therefore the more beautiful what it could be was."}]},{"type":"image","url":"s14_recap_1.webp","caption":"","alt":null},{"type":"paragraph","children":[{"type":"plain","text":"When I was watching season two, sometimes I felt like they were rushing to get the plot laid out as fast as possible, but I'm glad they told the story about Ekko and Powder in another universe slowly and carefully."}]}],"postMetadata":{"id":"s14-recap","title":"S14 Recap","description":"I did not play a lot of league during 2024, but I had a few unforgettable moments nonetheless.","category":"retrospective","topic":"gaming","tags":[],"publishDate":"2025-01-07","pathname":"s14-recap"},"last5posts":[{"id":"observation-on-programming-with-ai","title":"Observation on Programming with AI","description":"I reckoned getting familiar with AI coding tools is necessary, tried some, and to my surprise, I turned out to be quite optimistic.","category":"essay","topic":"programming","tags":[],"publishDate":"2025-03-13","pathname":"observation-on-programming-with-ai"},{"id":"blogging-and-digital-gardening","title":"Blogging and Digital Gardening in the Social Platform and Generative AI Era","description":"I talk to myself about why bother writing at somewhere nobody comes.","category":"essay","topic":"life","tags":[],"publishDate":"2025-02-11","pathname":"blogging-and-digital-gardening"},{"id":"a-redemption-three-years-later","title":"A Redemption Three Years Later","description":"CD PROJEKT RED made a promise about Night City, which they broke. Three years later they had another attempt, and to me, it was their redemption.","category":"review","topic":"gaming","tags":[],"publishDate":"2025-01-13","pathname":"a-redemption-three-years-later"},{"id":"s14-recap","title":"S14 Recap","description":"I did not play a lot of league during 2024, but I had a few unforgettable moments nonetheless.","category":"retrospective","topic":"gaming","tags":[],"publishDate":"2025-01-07","pathname":"s14-recap"},{"id":"thoughts-on-building-a-game-with-xstate","title":"Thoughts on Building a Game with XState","description":"After hearing about XState's good reputation for years, I used it to build the prototype for my game. These are my thoughts.","category":"note","topic":"game development","tags":[],"publishDate":"2025-01-04","pathname":"thoughts-on-building-a-game-with-xstate"}],"categoryPosts":[{"id":"site-patch-notes-2024-redesign","title":"Site Patch Notes: 2024 Redesign","description":"The 2024 redesign is finally here! I went on a journey of learning editorial design, and did an overhaul to this site's design, both functionality-wise and visual-wise.","category":"retrospective","topic":"meta","tags":[],"publishDate":"2024-08-18","pathname":"site-patch-notes-2024-redesign"},{"id":"4-years-reflection","title":"4 Years Reflection","description":"Another two years of life as a full-time developer has passed. Many things changed and many lessons learned. It's a perfect timing to look back and reflect.","category":"retrospective","topic":"career","tags":[],"publishDate":"2024-04-08","pathname":"4-years-reflection"},{"id":"s13-recap","title":"S13 Recap","description":"After a three years gap, I'm back to league.","category":"retrospective","topic":"gaming","tags":[],"publishDate":"2024-01-23","pathname":"s13-recap"},{"id":"refactor-blog-2023-markdown-based-content","title":"Refactor Blog 2023: Markdown Based Content","description":"Embracing a different approach toward my own data, I made a change to the content hosting method of my blog.","category":"retrospective","topic":"meta","tags":[],"publishDate":"2023-06-19","pathname":"refactor-blog-2023-markdown-based-content"},{"id":"first-game-jam-postmortem","title":"First Game Jam Postmortem","description":"I attended a game jam for the first time in my life. It was the best decision I made as an indie game developer in many years.","category":"retrospective","topic":"game development","tags":[],"publishDate":"2023-05-23","pathname":"first-game-jam-postmortem"}],"categories":[{"name":"essay","count":13},{"name":"review","count":15},{"name":"retrospective","count":15},{"name":"note","count":9},{"name":"research","count":3}]},"__N_SSG":true}