{"pageProps":{"postContent":[{"type":"paragraph","children":[{"type":"plain","text":"Two years ago, I wrote "},{"type":"link","text":"2 Years Reflection","url":"https://asukawang.com/blog/2-years-reflection"},{"type":"plain","text":" to reflect on working as a full time developer for two years. As I am facing changes exactly four years after the day my developer career started, it seems like a perfect time for another reflection."}]},{"type":"heading","children":[{"type":"plain","text":"The Job"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"My employer is okay. Still not satisfied with my salary, but I'm happy with everything else. I learn something every day; I make friends; and there is almost no need for overtime at all, which means I got time to pursue my indie game developer dream."}]},{"type":"paragraph","children":[{"type":"plain","text":"Regarding the \"day job, hobby job\" matter, however, my thoughts have changed."}]},{"type":"paragraph","children":[{"type":"plain","text":"Like I said two years ago, this place is such a comfort zone. I tried to leverage its work-life balance to be a indie-developer-at-night for a year, only to find out it's not sustainable."}]},{"type":"paragraph","children":[{"type":"plain","text":"I get burnt out. Even for something small, a proof of concept for example, game development is a months-long time-consuming process. During the time I can't invest time in other activities, including things I love like playing games. It leads to the conflict between the thoughts of \"I should be responsible for my own dream\" and \"I wish to enjoy other aspects of my life\", which takes a toll on my mental every day, eventually affecting my productivities at work."}]},{"type":"paragraph","children":[{"type":"plain","text":"My new plan is to focus on day job, at least for now. If I find enough financial independence, then I will focus on my dream. This will be a decade-long process, but it seems more feasible than betting on me burning the candle at both ends."}]},{"type":"paragraph","children":[{"type":"plain","text":"I reckon this plan works with my current employee. Due to reorganization, starting from April I'm changing department, somewhere I wanted since four years ago. Practically my responsibilities stay the same, but I still take it as an optimistic milestone. If there is ever an opportunity to change gear, it is now."}]},{"type":"paragraph","children":[{"type":"plain","text":"I'll give it a try for some time. If it isn't, then maybe it's time considering my next step."}]},{"type":"heading","children":[{"type":"plain","text":"The Work"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"I learned some much as a developer in last two years. Or at least I think I did."}]},{"type":"paragraph","children":[{"type":"plain","text":"There were time I thought our code review process was too sloppy. \"They wouldn't be doing like this in FAANG!\" I thought. Then we had new (experienced) members that asks a lot of good questions in pull requests. \"So this is more like how they doing it in FAANG\" I thought. And I struggled in every second of it."}]},{"type":"paragraph","children":[{"type":"plain","text":"I never consider myself having too much ego or pride in work. I'm not the most talented developer in the team and I know it, the best way to live with that is to be humble. But even with that mindset, having every pull request questioned and asked to fix for dozens of time before merging, is still a very humbling experience."}]},{"type":"paragraph","children":[{"type":"plain","text":"There were growing pains. But I believe the peak has passed, and I've become a better developer than I was before."}]},{"type":"heading","children":[{"type":"plain","text":"The Code"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"Still enjoying coding, and occasional joy of the \"a-ha\" moment."}]},{"type":"paragraph","children":[{"type":"plain","text":"Recently I invest more and more time on high level design before writing first line of code. Developing without clear structure is shooting myself in the foot, I learned that the hard way."}]},{"type":"paragraph","children":[{"type":"plain","text":"I applied this to other aspects as well, like the visual design of my blog. I used to jump right into Figma after blunt outline of the first idea emerges in my head, bearing the wishful thinking of if I blindly tinker enough I will hit the sweet spot somehow. Now I do research after research, asking myself what direction am I aiming, what goal am I pursuing, before committing anything."}]},{"type":"paragraph","children":[{"type":"plain","text":"And research is fun. I have always loved bookstores, recently they have become one of my favorite places to go. All the books on the shelfs, and the knowledge held by it, shine unlimited promises of their possibilities in my eyes."}]},{"type":"paragraph","children":[{"type":"plain","text":"I guess I learned to see my craft from a bigger picture, and the enjoyment of it."}]}],"postMetadata":{"id":"4-years-reflection","title":"4 Years Reflection","description":"Another two years of life as a full-time developer has passed. Many things changed and many lessons learned. It's a perfect timing to look back and reflect.","category":"Life","tags":[],"publishDate":"2024-04-08","pathname":"4-years-reflection"},"last5posts":[{"id":"site-patch-notes-2024-redesign","title":"Site Patch Notes: 2024 Redesign","description":"The 2024 redesign is finally here! I went on a journey of learning editorial design, and did an overhaul to this site's design, both functionality-wise and visual-wise.","category":"Meta","tags":[],"publishDate":"2024-08-18","pathname":"site-patch-notes-2024-redesign"},{"id":"a-peek-of-the-world","title":"A Peek of the World","description":"I went to Copenhagen and London for my honeymoon, the first trip to Europe in my life. Some memories keep staying on my mind and I have many thoughts about them.","category":"Life","tags":[],"publishDate":"2024-06-16","pathname":"a-peek-of-the-world"},{"id":"godot-essentials","title":"Godot Essentials","description":"The biggest lessons I learned in my first Godot project.","category":"Game Development","tags":[],"publishDate":"2024-04-21","pathname":"godot-essentials"},{"id":"4-years-reflection","title":"4 Years Reflection","description":"Another two years of life as a full-time developer has passed. Many things changed and many lessons learned. It's a perfect timing to look back and reflect.","category":"Life","tags":[],"publishDate":"2024-04-08","pathname":"4-years-reflection"},{"id":"improving-greatness","title":"Improving Greatness","description":"Breath of the Wild is one of the most impactful game in last decade. Yet for its successor, Nintendo built an even more polished version on an already magnificent fundamental.","category":"Gaming","tags":[],"publishDate":"2024-03-17","pathname":"improving-greatness"}],"categoryPosts":[{"id":"a-peek-of-the-world","title":"A Peek of the World","description":"I went to Copenhagen and London for my honeymoon, the first trip to Europe in my life. Some memories keep staying on my mind and I have many thoughts about them.","category":"Life","tags":[],"publishDate":"2024-06-16","pathname":"a-peek-of-the-world"}],"categories":[{"name":"Meta","count":5},{"name":"Life","count":6},{"name":"Game Development","count":5},{"name":"Gaming","count":12},{"name":"League of Legends","count":8},{"name":"Web Development","count":4},{"name":"HKT48","count":4},{"name":"Programming","count":3},{"name":"Movie","count":2}]},"__N_SSG":true}