{"pageProps":{"postContent":[{"type":"paragraph","children":[{"type":"plain","text":"I did not enjoy Breath of the Wild."}]},{"type":"paragraph","children":[{"type":"plain","text":"It's a great game. The most freedom I've ever had in a game with a story. I appreciate its great design; I just did not crave playing it.\nHowever, that was exactly what happened to me with Tears of the Kingdom."}]},{"type":"paragraph","children":[{"type":"plain","text":"And the reason why I love TOTK is what it was not enough to me in BOTW."}]},{"type":"paragraph","children":[{"type":"plain","text":"The open world in BOTW is magnificent. Every bit of the terrain in the game is traversable. No game had ever granted such freedom to players."}]},{"type":"paragraph","children":[{"type":"plain","text":"With such an advantage, the exploration and interaction with the Kingdom of Hyrule became the main content; other components in game, including the main quest, shrines, hidden treasures' purpose, was to facilitate the open world."}]},{"type":"paragraph","children":[{"type":"plain","text":"However, those facilitators were not enough for me. To be able to climb every visible mountain in the world is cool, but neither the treasure hidden beneath nor the excitement of finding it was seductive enough for me. In short, I did not enjoy the world exploration gameplay."}]},{"type":"paragraph","children":[{"type":"plain","text":"Tears of the Kingdom, on the other hand, had me spending hours on exploration and wanting for more."}]},{"type":"paragraph","children":[{"type":"plain","text":"My favorite part of TOTK exploration gameplay is how it motivates players to explore. The system is unchanged; all secrets in BOTW are still there; Nintendo simply added more contents to the world: wells, dungeons, worker who can't figure out how to tie a pillar, and tired Koroks (I never bothered). On top of that, they added two whole-sized regions: the Depths, and the Sky."}]},{"type":"paragraph","children":[{"type":"plain","text":"The Depths, where players can't see through boundless darkness, is the highlight of TOTK's game design. Capitalizing on the nature of darkness, Nintendo cleverly fixed a key issue in it's prequel's exploration-reward feedback loop."}]},{"type":"paragraph","children":[{"type":"plain","text":"In BOTW, players see a landscape that intrigues them, go there to find some secrets or next interesting landscape, and so on. What happens when there is no interesting landscape? They lose the drive to enjoy the game's main content. It was what happened to me. I reckon most players unlocked every Sheikah Tower, but only a few of them discovered every hidden Koroks."}]},{"type":"paragraph","children":[{"type":"plain","text":"Players will consume content that has their attention to scratch the itch. The key is how to draw their attention in the first place."}]},{"type":"paragraph","children":[{"type":"plain","text":"The Sheikah Towers are the most visible objects in the game. Controller vibrates when a shrine is near. Both are great at drawing players' attention."}]},{"type":"paragraph","children":[{"type":"plain","text":"Back to the Depths. By the nature of darkness, everything that glows draws attention. So Nintendo made the Lightroots the most noticeable target, and by unlocking them, players are granted a great sense of safety, along with a starting point to the next destination."}]},{"type":"paragraph","children":[{"type":"plain","text":"The reward of exploration is the ability for further exploration. An elegant self-enhancing feedback loop. The greatest one in the game."}]},{"type":"paragraph","children":[{"type":"plain","text":"Nintendo didn't stop there. They connected the Depths and the Surface by making them symmetrical, also the Depths and the Sky by placing glowing flowers in the Sky, which helps players to see in the Depths."}]},{"type":"paragraph","children":[{"type":"plain","text":"With these connections and organic guidances, players have the tools to form their own route to adventure in the world. Every time players find something, it leads to somewhere, and they know it."}]},{"type":"paragraph","children":[{"type":"plain","text":"These two feedback loops are the backbone of Tears of the Kingdom's open world gameplay."}]},{"type":"paragraph","children":[{"type":"plain","text":"Nintendo found the answer to the open world feedback loop issue in BOTW. I think they nailed it in this game, and for that, TOTK is a better game to me. It is an improved version of an already exceptional foundation. An improved greatness."}]}],"postMetadata":{"id":"improving-greatness","title":"Improving Greatness","description":"Breath of the Wild is one of the most impactful game in last decade. Yet for its successor, Nintendo built an even more polished version on an already magnificent fundamental.","category":"Gaming","tags":[],"publishDate":"2024-03-17","pathname":"improving-greatness"},"last5posts":[{"id":"site-patch-notes-2024-redesign","title":"Site Patch Notes: 2024 Redesign","description":"The 2024 redesign is finally here! I went on a journey of learning editorial design, and did an overhaul to this site's design, both functionality-wise and visual-wise.","category":"Meta","tags":[],"publishDate":"2024-08-18","pathname":"site-patch-notes-2024-redesign"},{"id":"a-peek-of-the-world","title":"A Peek of the World","description":"I went to Copenhagen and London for my honeymoon, the first trip to Europe in my life. Some memories keep staying on my mind and I have many thoughts about them.","category":"Life","tags":[],"publishDate":"2024-06-16","pathname":"a-peek-of-the-world"},{"id":"godot-essentials","title":"Godot Essentials","description":"The biggest lessons I learned in my first Godot project.","category":"Game Development","tags":[],"publishDate":"2024-04-21","pathname":"godot-essentials"},{"id":"4-years-reflection","title":"4 Years Reflection","description":"Another two years of life as a full-time developer has passed. Many things changed and many lessons learned. It's a perfect timing to look back and reflect.","category":"Life","tags":[],"publishDate":"2024-04-08","pathname":"4-years-reflection"},{"id":"improving-greatness","title":"Improving Greatness","description":"Breath of the Wild is one of the most impactful game in last decade. Yet for its successor, Nintendo built an even more polished version on an already magnificent fundamental.","category":"Gaming","tags":[],"publishDate":"2024-03-17","pathname":"improving-greatness"}],"categoryPosts":[{"id":"god-of-war-ragnarok","title":"God of War Ragnarök","description":"As a successor of a game with solid gameplay and extraordinary narrative, God of War Ragnarök made attempts to be something better on many aspects. Some of them were great, some others were not.","category":"Gaming","tags":[],"publishDate":"2022-11-19","pathname":"god-of-war-ragnarok"},{"id":"dark-souls","title":"Dark Souls","description":"Though once a cult classic, the soul-like has become a mainstream genre. I beat its early entry to see its secrets and the reputation of unmerciful difficulty.","category":"Gaming","tags":[],"publishDate":"2022-07-19","pathname":"dark-souls"}],"categories":[{"name":"Meta","count":5},{"name":"Life","count":6},{"name":"Game Development","count":5},{"name":"Gaming","count":12},{"name":"League of Legends","count":8},{"name":"Web Development","count":4},{"name":"HKT48","count":4},{"name":"Programming","count":3},{"name":"Movie","count":2}]},"__N_SSG":true}