{"pageProps":{"postContent":[{"type":"paragraph","children":[{"type":"plain","text":"Building my blog from scratch means dealing with content management by myself: the APIs, the server, and the databases. Each task would be a new challenge for me and likely cost more time than the whole blog building."}]},{"type":"paragraph","children":[{"type":"plain","text":"In the old versions of my blog, I put all the contents in the source. Every time I wrote new posts, I had to commit and deploy again. In this way, I avoided the backend, but it also lowered my motivation to write blogs, because I had to commit and deploy for every new post."}]},{"type":"paragraph","children":[{"type":"plain","text":"Fortunately, headless CMS solves this problem perfectly. I decided to use headless CMS for this refactoring, for I consider it would be the best solution in this scenario. Also, I figured that having experience using headless CMS would be a good thing."}]},{"type":"heading","children":[{"type":"plain","text":"Choices"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"This is the first time I use headless CMS. I did some research to discover the best service that fits my requirements, which are:"}]},{"type":"list","ordered":false,"children":[{"type":"listItem","children":[{"type":"plain","text":"cheap: if my blog has more traffic in the future, maybe I'll increase the budget for the CMS, but right now, I'm not going to invest too much"}]},{"type":"listItem","children":[{"type":"plain","text":"easy to use: I want it as easy as possible for me to write and publish blog posts"}]},{"type":"listItem","children":[{"type":"plain","text":"easy to dev: for a paid solution, I want it to take as little time as possible to implement"}]}]},{"type":"paragraph","children":[{"type":"plain","text":"Contentful ends up becoming my choice among several candidates."}]},{"type":"heading","children":[{"type":"plain","text":"Implementation"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"Contentful provides many APIs, but the two APIs of entry and entry collection are enough for my usage. It also provides API test tools with token input, so the API part is comprehensive and easy to use."}]},{"type":"paragraph","children":[{"type":"plain","text":"The biggest problem I faced during implementation was the type of API data. I looked for @types, but there was no well-maintained type package. I ended up writing the type by myself, checking the dev tool."}]},{"type":"heading","children":[{"type":"plain","text":"Usage"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"I like the content model and content pattern a lot. The content model is easy to learn and modify. So easy that I was not stuck when designing the content model at all, then found myself having to edit it after because I didn't think carefully enough."}]},{"type":"paragraph","children":[{"type":"plain","text":"I've published several posts since then, and I'm pretty happy so far. Usually, I have my article finished in notion, and I only need to set the metadata manually, copy-paste the article, and the post is published. The data updates immediately; it's the best part of my Contentful experience so far."}]},{"type":"heading","children":[{"type":"plain","text":"Future"}],"depth":1},{"type":"paragraph","children":[{"type":"plain","text":"There is one concern over Contentful: the price. I have not met the limit of free usage yet, and I don't think I would meet it soon, but even the cheapest plan hardly surpasses my budget. If that day comes, I will be very likely migrating to other services."}]},{"type":"paragraph","children":[{"type":"plain","text":"One of the potential alternatives I'm interested in is the notion API. I write all of my posts on notion, and I enjoy using it a lot. If the notion API is capable of being the headless CMS, I would consider it very seriously."}]}],"postMetadata":{"id":"refactor-blog-3-headless-cms","title":"Refactor Blog: (3) Headless CMS","description":"","category":"Meta","tags":[],"publishDate":"2021-03-28","pathname":"refactor-blog-3-headless-cms"},"last5posts":[{"id":"site-patch-notes-2024-redesign","title":"Site Patch Notes: 2024 Redesign","description":"The 2024 redesign is finally here! I went on a journey of learning editorial design, and did an overhaul to this site's design, both functionality-wise and visual-wise.","category":"Meta","tags":[],"publishDate":"2024-08-18","pathname":"site-patch-notes-2024-redesign"},{"id":"a-peek-of-the-world","title":"A Peek of the World","description":"I went to Copenhagen and London for my honeymoon, the first trip to Europe in my life. Some memories keep staying on my mind and I have many thoughts about them.","category":"Life","tags":[],"publishDate":"2024-06-16","pathname":"a-peek-of-the-world"},{"id":"godot-essentials","title":"Godot Essentials","description":"The biggest lessons I learned in my first Godot project.","category":"Game Development","tags":[],"publishDate":"2024-04-21","pathname":"godot-essentials"},{"id":"4-years-reflection","title":"4 Years Reflection","description":"Another two years of life as a full-time developer has passed. Many things changed and many lessons learned. It's a perfect timing to look back and reflect.","category":"Life","tags":[],"publishDate":"2024-04-08","pathname":"4-years-reflection"},{"id":"improving-greatness","title":"Improving Greatness","description":"Breath of the Wild is one of the most impactful game in last decade. Yet for its successor, Nintendo built an even more polished version on an already magnificent fundamental.","category":"Gaming","tags":[],"publishDate":"2024-03-17","pathname":"improving-greatness"}],"categoryPosts":[{"id":"site-patch-notes-2024-redesign","title":"Site Patch Notes: 2024 Redesign","description":"The 2024 redesign is finally here! I went on a journey of learning editorial design, and did an overhaul to this site's design, both functionality-wise and visual-wise.","category":"Meta","tags":[],"publishDate":"2024-08-18","pathname":"site-patch-notes-2024-redesign"},{"id":"refactor-blog-2023-markdown-based-content","title":"Refactor Blog 2023: Markdown Based Content","description":"Embracing a different approach toward my own data, I made a change to the content hosting method of my blog.","category":"Meta","tags":[],"publishDate":"2023-06-19","pathname":"refactor-blog-2023-markdown-based-content"}],"categories":[{"name":"Meta","count":5},{"name":"Life","count":6},{"name":"Game Development","count":5},{"name":"Gaming","count":12},{"name":"League of Legends","count":8},{"name":"Web Development","count":4},{"name":"HKT48","count":4},{"name":"Programming","count":3},{"name":"Movie","count":2}]},"__N_SSG":true}