{"pageProps":{"postContent":[{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"I joined "},{"type":"link","body":[{"type":"textBody","style":"plain","value":"Gamedev.js Jam 2023"}],"url":"https://itch.io/jam/gamedevjs-2023"},{"type":"textBody","style":"plain","value":". The first game jam I've ever attended."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"In late 2022 I decided to commit to indie game development in 2023; attending game jam was one of my goals. But I was thinking about (and only knew) the major ones, "},{"type":"link","body":[{"type":"textBody","style":"plain","value":"Brackeys"}],"url":"https://itch.io/jam/brackeys-9"},{"type":"textBody","style":"plain","value":", "},{"type":"link","body":[{"type":"textBody","style":"plain","value":"GMTK"}],"url":"https://itch.io/jam/gmtk-jam-2022"},{"type":"textBody","style":"plain","value":", etc."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"In late March 2023, I found out a colleague is also a fellow indie game developer. An experienced one, actually. He has joined jams several times and recommended I join Gamedev.js Jam 2023."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"At the time I was building the prototype of my (hopefully) first commercial release. I could see all the benefits of joining a jam; my only concern was the aftermath of changing projects in the middle of building one. Then my colleague told me one of the effects of attending game jams:"}]},{"type":"quote","body":[{"type":"textBody","style":"plain","value":"Gamejams help you stay small, and help you get good at discarding ideas xD"}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"Scope creep has always been an issue since I start making games. I had to keep reminding myself to be careful before adding those cool new features. The last time I had a public release was in 2009. I needed a finished game, and to achieve that I needed to be aware of the scope. This was the reason I decided to join the jam."}]},{"type":"heading","level":1,"body":[{"type":"textBody","style":"plain","value":"Planning"}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"The theme of the jam was \"Time.\""}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"Although the jam announcement explicitly says that attendees can interpret the theme however they like, I wanted to make time the absolute core of the gameplay instead of being only part of it."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"It took me three days to reach an idea I was excited enough to move to the next step. I took inspirations mainly from two resources:"}]},{"type":"list","ordered":false,"items":[{"type":"listItem","body":[{"type":"textBody","style":"plain","value":"Rent (2005): a musical drama movie, which was an adaption of my wife's favorite Broadway musical."}]},{"type":"listItem","body":[{"type":"textBody","style":"plain","value":"Stacklands (2022): a card-based village building survivor with equilibrium-chasing flavor."}]}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"From Rent I was inspired by that life may be measured by all the decisions made and all the struggles coped with. Then I thought facing and dealing with all these obstacles in life aligns with the popping cards mechanic in Stacklands, and its equilbrium-chasing gameplay."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"The game is named \"How Do You Measure a Year.\" It is directly borrowed from the lyrics of one song in Rent. The game is a time-management simulation, where players need to schedule their day routine, and try to reach balance between money, health and mental."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"I focused mostly on gameplay, and if the progress is good, I may spare some time on art. No plan for audio was made."}]},{"type":"heading","level":1,"body":[{"type":"textBody","style":"plain","value":"Building"}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"Although this was a \"Gamedev.js\" jam, I checked that Unity3D-made games are eligible as long as it runs on a browser. Considering I'm likely going to keep use Unity as my main tool to build game in the foreseable future, I decided to go with it."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"The coding of basic mechanics was smooth. However, for some reason I thought the submission deadline was around early May, but it was actually late April, four days before I found out the truth."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"Unfortunately my coding did not speed up even after I knew the deadline was near. I've had the outline of the gameplay in my head, but mechanic details were not figured out, and that severely killed my flow and productivity."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"I took the deadline day off to do a final sprint. Thanks to that I barely managed to finish up the main gameplay, but still I had to massively cut narratives and leave art and audio totally untouched."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"After I built the game to where I considered it was in submittable status and there was no time enough to make impactable changes, I clicked the build button and submitted it. Then I found out there was a major visual bug -- not directly affecting gameplay but a key part of UI. That was about 40 minutes before the deadline."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"I tried to solve the issue. It was not fixed. I tried another approach. It was not ideal but it works at least. I clicked build and shipped it. The time was 17 minutes before the deadline. And that concludes my first ever jam game building."}]},{"type":"heading","level":1,"body":[{"type":"textBody","style":"plain","value":"Reviews"}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"I later realized there was another critical bug: the good ending screen where when a year passed in in-game time, the game should pause and the player's yearly statics should be displayed. That screen does not appear. The player's one year is not measured at all! This game's name doesn't even make sense!"}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"Besides that, due to lack of art and UI polishing, this game does not have the most intuitive controls. New players are most likely to see the game over-screen several times before having a grasp of what the game is about. I was expecting people to open the game, get frustrated about the UI, then leave with a bad review or not even one."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"The second day after the deadline, I woke up and found two reviews on my page. Both were positive; one specifically said that after the reviewer understood the mechanics, they were impressed with how the player action and game statics dynamic works. A lot of kind words."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"I could not ask for a better way to start a day, or to conclude my first jam."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"Later, my friends also said that they had fun, with reactions I aimed for while designing the gameplay."}]},{"type":"quote","body":[{"type":"textBody","style":"plain","value":"I work twelve hours a day and my save is dropping still??"}]},{"type":"quote","body":[{"type":"textBody","style":"plain","value":"I quit to exercise for helping my health and my savings are gone in less than two weeks"}]},{"type":"quote","body":[{"type":"textBody","style":"plain","value":"Is that how you are supposed to feel with a minimal wage? I know both my health and mental need help but I can't afford to quit"}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"Their overall review may be biased (love ya hommies), but the reactions were not. My gameplay worked the way I wanted. People played my game and they had fun. It was a magical moment."}]},{"type":"heading","level":1,"body":[{"type":"textBody","style":"plain","value":"Reviewing"}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"I was deeply impressed by how itch.io crafted its jam community system. For every comment a submission received, the reviewer's submission is shown below their comment. It's very natural for a reviewee to review the reviewer's submission, thus the connections between creator and player are built."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"I've been looking for an indie dev community where I'm comfortable enough to start or join a conversation since last year. Discord, Reddit, you name it. The closest one so far was "},{"type":"link","body":[{"type":"textBody","style":"plain","value":"mastodon.gamedev.place"}],"url":"https://mastodon.gamedev.place"},{"type":"textBody","style":"plain","value":". But itch.io, or at least this jam, helped me to have the most connection with fellow indie devs and players. And it was so elegant!"}]},{"type":"heading","level":1,"body":[{"type":"textBody","style":"plain","value":"Result"}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"On May 9th the result was announced. Out of 202 entries, my entry \"How Do You Measure a Year\" got 80th overall."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"With 7th in \"theme\" and 10th in \"innovation\" criteria."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"Even the 80th overall was beyond my expectation, let alone getting top ranks in two idea-related criteria."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"After all these years, studying game design theories, reviewing games after playing, and most importantly, forging game ideas only in my head without actually building one, I didn't know if those time were ever meaningful, if I was just pretending I'm chasing my dream."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"Now I know there are people like my idea."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"It's a small jam, I know. My entry had only 16 ratings, I know. But it was a confidence boost I needed badly. I gained so much by joining this jam, but maybe this is the most precious one."}]},{"type":"heading","level":1,"body":[{"type":"textBody","style":"plain","value":"Lesson"}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"I was just happy that I finally got to finish a game. My first public release in 14 years! Hooray! This was more like merely a promise kept from myself to myself that I'm done only talking about being a indie dev."}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"I'm also happy now I see the path toward my next release more clearly. I found some critical issues that I have to resolve, including:"}]},{"type":"list","ordered":false,"items":[{"type":"listItem","body":[{"type":"textBody","style":"plain","value":"Invest more time in art. No matter what platform I'm going to release on, the first thing players see are the thumbnail and screenshots. Gameplay doesn't matter if I can't get people interested, and I believe art is the key."}]},{"type":"listItem","body":[{"type":"textBody","style":"plain","value":"Spend more time planning and documenting before building. I encountered severe flow and motivation loss while building my entry, because I only had an outline of the idea, so I had to stop and figure out the details before writing the code for every component of the game, which killed the momentum. Worst case scenario it may kill the whole project."}]}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"These are not \"issues,\" but still something I found out (again) and plan to keep doing in the future:"}]},{"type":"list","ordered":false,"items":[{"type":"listItem","body":[{"type":"textBody","style":"plain","value":"Access to a large variety of art pieces helps immensely. I played Stacklands not because I was studying it, but only because I wanted that equilibrium kick. Turns out it inspired my entry's core gameplay. The same goes for the Rent movie. Everything may be my muse."}]},{"type":"listItem","body":[{"type":"textBody","style":"plain","value":"Gamejam is such a good way for finding small-scoped ideas. I'm considering completing my entry and making it my first commercial release. I see this as a solid path for the first several releases of my studio."}]},{"type":"listItem","body":[{"type":"textBody","style":"plain","value":"Playtesting and getting feedback is important and necessary. Also, it's impossible to find a team or even an audience without showing people what you're capable of."}]}]},{"type":"paragraph","body":[{"type":"textBody","style":"plain","value":"And there goes my first jam. Extremely glad I decided to join it. Still tons of work to do, but I see possibilities lie before me."}]}],"postMetadata":{"id":"first-game-jam-postmortem","title":"First Game Jam Postmortem","description":"I attended a game jam for the first time in my life. It was the best decision I made as an indie game developer in many years.","category":"retrospective","topic":"game development","tags":[],"publishDate":"2023-05-23","pathname":"first-game-jam-postmortem"},"last5posts":[{"id":"observation-on-programming-with-ai","title":"Observation on Programming with AI","description":"I reckoned getting familiar with AI coding tools is necessary, tried some, and to my surprise, I turned out to be quite optimistic.","category":"essay","topic":"programming","tags":[],"publishDate":"2025-03-13","pathname":"observation-on-programming-with-ai"},{"id":"blogging-and-digital-gardening","title":"Blogging and Digital Gardening in the Social Platform and Generative AI Era","description":"I talk to myself about why bother writing at somewhere nobody comes.","category":"essay","topic":"life","tags":[],"publishDate":"2025-02-11","pathname":"blogging-and-digital-gardening"},{"id":"a-redemption-three-years-later","title":"A Redemption Three Years Later","description":"CD PROJEKT RED made a promise about Night City, which they broke. Three years later they had another attempt, and to me, it was their redemption.","category":"review","topic":"gaming","tags":[],"publishDate":"2025-01-13","pathname":"a-redemption-three-years-later"},{"id":"s14-recap","title":"S14 Recap","description":"I did not play a lot of league during 2024, but I had a few unforgettable moments nonetheless.","category":"retrospective","topic":"gaming","tags":[],"publishDate":"2025-01-07","pathname":"s14-recap"},{"id":"thoughts-on-building-a-game-with-xstate","title":"Thoughts on Building a Game with XState","description":"After hearing about XState's good reputation for years, I used it to build the prototype for my game. These are my thoughts.","category":"note","topic":"game development","tags":[],"publishDate":"2025-01-04","pathname":"thoughts-on-building-a-game-with-xstate"}],"categoryPosts":[{"id":"s14-recap","title":"S14 Recap","description":"I did not play a lot of league during 2024, but I had a few unforgettable moments nonetheless.","category":"retrospective","topic":"gaming","tags":[],"publishDate":"2025-01-07","pathname":"s14-recap"},{"id":"site-patch-notes-2024-redesign","title":"Site Patch Notes: 2024 Redesign","description":"The 2024 redesign is finally here! I went on a journey of learning editorial design, and did an overhaul to this site's design, both functionality-wise and visual-wise.","category":"retrospective","topic":"meta","tags":[],"publishDate":"2024-08-18","pathname":"site-patch-notes-2024-redesign"},{"id":"4-years-reflection","title":"4 Years Reflection","description":"Another two years of life as a full-time developer has passed. Many things changed and many lessons learned. It's a perfect timing to look back and reflect.","category":"retrospective","topic":"career","tags":[],"publishDate":"2024-04-08","pathname":"4-years-reflection"},{"id":"s13-recap","title":"S13 Recap","description":"After a three years gap, I'm back to league.","category":"retrospective","topic":"gaming","tags":[],"publishDate":"2024-01-23","pathname":"s13-recap"},{"id":"refactor-blog-2023-markdown-based-content","title":"Refactor Blog 2023: Markdown Based Content","description":"Embracing a different approach toward my own data, I made a change to the content hosting method of my blog.","category":"retrospective","topic":"meta","tags":[],"publishDate":"2023-06-19","pathname":"refactor-blog-2023-markdown-based-content"}],"categories":[{"name":"essay","count":13},{"name":"review","count":15},{"name":"retrospective","count":15},{"name":"note","count":9},{"name":"research","count":3}]},"__N_SSG":true}